{"sections":{"main":{"type":"main-blog","disabled":true,"settings":{"blog_post":"3","blog_text_align":"left","blog_show_author":true,"blog_show_date":true}},"1655366933f2220f1e":{"type":"Brands","disabled":true,"blocks":{"141f0854-45fd-4c6c-95c7-de3b18b83510":{"type":"image","settings":{"text2":"Floriem"}},"b3a502ff-2531-4d9a-866e-a301219d68d9":{"type":"image","settings":{"text2":"Cerm"}},"96a60da3-bafa-4cd8-bde8-5ffac7fd78d1":{"type":"image","settings":{"text2":"Invity"}}},"block_order":["141f0854-45fd-4c6c-95c7-de3b18b83510","b3a502ff-2531-4d9a-866e-a301219d68d9","96a60da3-bafa-4cd8-bde8-5ffac7fd78d1"],"settings":{"text":"BRANDS"}},"1657950663eb3e3016":{"type":"custom_privacy","blocks":{"9c6b1e2e-2426-42b7-9cf5-2d3410586337":{"type":"privacy_policy","settings":{"titleprivacy":"Privacy Policy","detailprivacy":"<p>This Privacy Policy describes how CERM (the “Site” or “we”) collects, uses, and discloses your Personal Information when you visit or make a purchase from the Site.<\/p>"}},"8cc92fd3-6185-44ed-9f28-193326c84829":{"type":"privacy_policy","settings":{"titleprivacy":"Collecting Personal Information","detailprivacy":"<p>When you visit the Site, we collect certain information about your device, your interaction with the Site, and information necessary to process your purchases. We may also collect additional information if you contact us for customer support. In this Privacy Policy, we refer to any information that can uniquely identify an individual (including the information below) as “Personal Information”. See the list below for more information about what Personal Information we collect and why.<\/p>"}},"4592f408-96c8-4e38-b79e-41423c453333":{"type":"privacy_policy","settings":{"titleprivacy":"Device Information","detailprivacy":"<p>● <strong>Examples of Personal Information collected:<\/strong> version of web browser, IP address, time zone, cookie information, what sites or products you view, search terms, and how you interact with the Site<\/p><p>●<strong> Purpose of collection<\/strong>: to load the Site accurately for you, and to perform analytics on Site usage to optimize our Site.<\/p><p>● <strong>Source of collection:<\/strong> Collected automatically when you access our Site using cookies, log files, web beacons, tags, or pixels.<\/p><p>● <strong>Disclosure for a business purpose: <\/strong>shared with our processor Shopify. Order information<\/p><p>● <strong>Examples of Personal Information collected: <\/strong>name, billing address, shipping address, payment information (including credit card numbers, email address, and phone number.<\/p><p>● <strong>Purpose of collection:<\/strong> to provide products or services to you to fulfill our contract, to process your payment information, arrange for shipping, and provide you with invoices and\/or order confirmations, communicate with you, screen our orders for potential risk or fraud, and when in line with the preference  you have shared with us, provide you with information or advertising relating to our products or services.<\/p><p>● <strong>Source of collection: <\/strong>collected from you.<\/p><p>●<strong> Disclosure for a business purpose:<\/strong> shared with our processor Shopify. Customer support information<\/p><p>●<strong> Purpose of collection:<\/strong> to provide customer support.<\/p><p><\/p><p>●<strong> Source of collection:<\/strong> collected from you.<\/p>"}},"7644f678-b640-40af-a21e-c3a1006f650f":{"type":"privacy_policy","settings":{"titleprivacy":"Sharing Personal Information","detailprivacy":"<p>We share your Personal Information with service providers to help us provide our services and fulfill our contracts with you, as described above. For example:We use Shopify to power our online store. You can read more about how Shopify uses your Personal Information here: <a href=\"https:\/\/www.shopify.com\/legal\/privacy.\" target=\"_blank\"><span style=\"text-decoration:underline\">https:\/\/www.shopify.com\/legal\/privacy. <\/span><\/a>We may share your Personal Information to comply with applicable laws and regulations, to respond to a subpoena, search warrant or other lawful request for information we receive, or to otherwise protect our rights.<\/p>"}},"5d78ab8e-0746-4fc7-a6bf-0d1dfb89fe3e":{"type":"privacy_policy","settings":{"titleprivacy":"Behavioural Advertising","detailprivacy":"<p>As described above, we use your Personal Information to provide you with targeted advertisements or marketing communications we believe may be of interest to you. For example:<br\/>We use Google Analytics to help us understand how our customers use the Site. You can read more about how Google uses your Personal Information here: https:\/\/policies.google.com\/privacy?hl=en.You can also opt-out of Google Analytics here: https:\/\/tools.google.com\/dlpage\/gaoptout.<br\/>We use Facebook events manager to help us understand how our customers use the Site.<br\/>For more information about how targeted advertising works, you can visit the Network Advertising Initiative’s (“NAI”) educational page at http:\/\/www.networkadvertising.org\/understanding-online-advertising\/how-does-it-work.<\/p><p>You can opt out of targeted advertising by:<br\/>✓ FACEBOOK - https:\/\/www.facebook.com\/settings\/?tab=ads<br\/>✓ GOOGLE - https:\/\/www.google.com\/settings\/ads\/anonymous<br\/>✓ BING - https:\/\/advertise.bingads.microsoft.com\/en-us\/resources\/policies\/personalized-ads]<br\/>✓ Additionally, you can opt out of some of these services by visiting the Digital Advertising Alliance’s opt-out portal at: <a href=\"http:\/\/optout.aboutads.info\/\" target=\"_blank\"><span style=\"text-decoration:underline\">http:\/\/optout.aboutads.info\/.<\/span><\/a><\/p>"}},"73d90a15-eaf2-42b2-afc1-d136a4a829dc":{"type":"privacy_policy","settings":{"titleprivacy":"Using Personal Information","detailprivacy":"<p>We use your personal Information to provide our services to you, which includes: offering products for sale, processing payments, shipping and fulfillment of your order, and keeping you up to date on new products, services, and offers.<\/p>"}},"8e1d6972-9a6b-4880-aaf2-8c08dc42bdc8":{"type":"privacy_policy","settings":{"titleprivacy":"Lawful Basis","detailprivacy":"<p>Pursuant to the General Data Protection Regulation (“GDPR”), if you are a resident of the European Economic Area (“EEA”), we process your personal information under the following lawful bases:<br\/>Your consent;<br\/>✓ The performance of the contract between you and the Site;<br\/>✓ Compliance with our legal obligations;<br\/>✓ To protect your vital interests;<br\/>✓ To perform a task carried out in the public interest;<br\/>✓ For our legitimate interests, which do not override your fundamental rights and freedoms.<\/p>"}},"30a3eb1a-02c0-4eb8-8411-a992233c4125":{"type":"privacy_policy","settings":{"titleprivacy":"Retention","detailprivacy":"<p>When you place an order through the Site, we will retain your Personal Information for our records unless and until you ask us to erase this information. For more information on your right of erasure, please see the ‘Your rights’ section below.<\/p>"}},"36727df4-e785-44ae-82f2-98b1d650a0c7":{"type":"privacy_policy","settings":{"titleprivacy":"Automatic Decision Making","detailprivacy":"<p>If you are a resident of the EEA, you have the right to object to processing based solely on automated decision-making (which includes profiling), when that decision-making has a legal effect on you or otherwise significantly affects you.<br\/>We DO NOT engage in fully automated decision-making that has a legal or otherwise significant effect using customer data.<br\/>Our processor Shopify uses limited automated decision-making to prevent fraud that does not have a legal or otherwise significant effect on you.<br\/>Services that include elements of automated decision-making include:<br\/>Temporary denylist of IP addresses associated with repeated failed transactions. This denylist persists for a small number of hours.<br\/>Temporary denylist of credit cards associated with denylisted IP addresses. This denylist persists for a small number of days.<\/p>"}},"6eb3d07b-17cc-42cf-9cc9-d29caf9d8ea9":{"type":"privacy_policy","settings":{"titleprivacy":"Selling Personal Information","detailprivacy":"<p>Our Site DOES NOT sells Personal Information. <\/p>"}},"5e16df30-8e08-4bb0-b2b6-e9b25c4f81cc":{"type":"privacy_policy","settings":{"titleprivacy":"GDPR","detailprivacy":"<p>If you are a resident of the EEA, you have the right to access the Personal Information we hold about you, to port it to a new service, and to ask that your Personal Information be corrected, updated, or erased. If you would like to exercise these rights, please contact us.<br\/>Your Personal Information will be initially processed in Ireland and then will be transferred outside of Europe for storage and further processing, including to Canada and the United States. For more information on how data transfers comply with the GDPR, see Shopify’s GDPR Whitepaper: <a href=\"https:\/\/help.shopify.com\/en\/manual\/your-account\/privacy\/GDPR.\" target=\"_blank\"><span style=\"text-decoration:underline\">https:\/\/help.shopify.com\/en\/manual\/your-account\/privacy\/GDPR.<\/span><\/a><\/p>"}},"81ee9332-102c-44e3-83ae-04b1fa93101e":{"type":"privacy_policy","settings":{"titleprivacy":"CCPA","detailprivacy":"<p>If you are a resident of California, you have the right to access the Personal Information we hold about you (also known as the ‘Right to Know’), to port it to a new service, and to ask that your Personal Information be corrected, updated, or erased. If you would like to exercise these rights, please contact us. <br\/>If you would like to designate an authorized agent to submit these requests on your behalf, please contact us at the address below.<\/p>"}},"6328a59f-c825-4bc9-a55b-b4e76c9fe832":{"type":"privacy_policy","settings":{"titleprivacy":"Cookies","detailprivacy":"<p>A cookie is a small amount of information that’s downloaded to your computer or device when you visit our Site. We use a number of different cookies, including functional, performance, advertising, and social media or content cookies. Cookies make your browsing experience better by allowing the website to remember your actions and preferences (such as login and region selection). This means you don’t have to re-enter this information each time you return to the site or browse from one page to another. Cookies also provide information on how people use the website, for instance whether it’s their first time visiting or if they are a frequent visitor.<br\/>We use the following cookies to optimize your experience on our Site and to provide our services.<\/p>"}},"f13697c0-d497-4cea-88ff-16ac7ad1a75a":{"type":"privacy_policy","settings":{"titleprivacy":"Do Not Track","detailprivacy":"<p>Please note that because there is no consistent industry understanding of how to respond to “Do Not Track” signals, we do not alter our data collection and usage practices when we detect such a signal from your browser.<\/p>"}},"09a65d9b-4eca-49a8-ae71-d8590b886ffe":{"type":"privacy_policy","settings":{"titleprivacy":"Changes","detailprivacy":"<p>We may update this Privacy Policy from time to time in order to reflect, for example, changes to our practices or for other operational, legal, or regulatory reasons.<\/p>"}},"ef827237-7d3e-4e79-af1a-735d51504853":{"type":"privacy_policy","settings":{"titleprivacy":"Contact","detailprivacy":"<p>For more information about our privacy practices, if you have questions, or if you would like to make a complaint, please contact us by e-mail at support@cermbeauty.com or by mail using the details provided below:<br\/>CERM, 8 Kaki Bukit Avenue 1 #02-02. Singapore 417941<br\/>Last updated: 18 Nov 2021<\/p>"}}},"block_order":["9c6b1e2e-2426-42b7-9cf5-2d3410586337","8cc92fd3-6185-44ed-9f28-193326c84829","4592f408-96c8-4e38-b79e-41423c453333","7644f678-b640-40af-a21e-c3a1006f650f","5d78ab8e-0746-4fc7-a6bf-0d1dfb89fe3e","73d90a15-eaf2-42b2-afc1-d136a4a829dc","8e1d6972-9a6b-4880-aaf2-8c08dc42bdc8","30a3eb1a-02c0-4eb8-8411-a992233c4125","36727df4-e785-44ae-82f2-98b1d650a0c7","6eb3d07b-17cc-42cf-9cc9-d29caf9d8ea9","5e16df30-8e08-4bb0-b2b6-e9b25c4f81cc","81ee9332-102c-44e3-83ae-04b1fa93101e","6328a59f-c825-4bc9-a55b-b4e76c9fe832","f13697c0-d497-4cea-88ff-16ac7ad1a75a","09a65d9b-4eca-49a8-ae71-d8590b886ffe","ef827237-7d3e-4e79-af1a-735d51504853"],"settings":{"ptitletitle":"Privacy Policy"}}},"order":["main","1655366933f2220f1e","1657950663eb3e3016"]}