{"sections":{"main":{"type":"main-blog","disabled":true,"settings":{"blog_post":"3","blog_text_align":"left","blog_show_author":true,"blog_show_date":true}},"1655366933f2220f1e":{"type":"Brands","disabled":true,"blocks":{"141f0854-45fd-4c6c-95c7-de3b18b83510":{"type":"image","settings":{"text2":"Floriem"}},"b3a502ff-2531-4d9a-866e-a301219d68d9":{"type":"image","settings":{"text2":"Cerm"}},"96a60da3-bafa-4cd8-bde8-5ffac7fd78d1":{"type":"image","settings":{"text2":"Invity"}}},"block_order":["141f0854-45fd-4c6c-95c7-de3b18b83510","b3a502ff-2531-4d9a-866e-a301219d68d9","96a60da3-bafa-4cd8-bde8-5ffac7fd78d1"],"settings":{"text":"BRANDS"}},"1657945564ae574c14":{"type":"custom_shipping","blocks":{"9a246145-b89e-4565-a5ab-0363183d7a24":{"type":"addtext","settings":{"titleship":"Order Processing","detailship":"<p>Orders will be shipped out from our warehouse 1-2 business days after order confirmation. All orders placed on Saturday, Sunday or public holidays will be processed on the following business day. Orders may take longer to process during sales or holiday seasons. A tracking notification with the order tracking number will be sent via e-mail as soon as the parcel leaves the warehouse.<br\/>Shipping information cannot be changed or updated once the order has been processed and shipped from our facility. Please make sure your delivery information is correct before making payment.<\/p>"}},"99ebf639-ea46-44d8-ac0c-d26c27018c8e":{"type":"addtext","settings":{"titleship":"How long will it take to get my package?","detailship":"<p>We currently use expedited global shipping to ensure you receive your products within 7 working days. These are our current estimated shipping lead times:<br\/>Singapore - 2-3 working days<br\/>USA - 2-5 working days <br\/>Rest of the world - 3-8 working days.<\/p>"}},"9b807ac0-424c-417c-a51c-45581a864563":{"type":"addtext","settings":{"titleship":"Where do you ship to?","detailship":"<p>Internationally, we ship to most countries and regions except: Afghanistan, Antarctica, British Indian Ocean Territory, Bouvet Island, Christmas Islands, Cocos Island, Comoros, Crimea Region of Ukraine, Cuba, Falkland Islands, French Southern Territories, Heard & McDonald Islands, Hong Kong and Macau SAR, Iran, Libya, Mayotte, Myanmar (Burma), Nauru, Niue, North Korea, Palestinian Territory Occupied, Pitcairn Island, Rwanda, Saint Helena, Sao Tome and Principe, Somalia, South Georgia and the South Sandwich Islands, St. Pierre and Miquelon, Sudan, Svalbard Jan Mayen Island, Syrian Arabic Republic, Tokelau and Western Sahara.<br\/>At the moment, we cannot ship to P.O. boxes.<\/p>"}},"bed89c2a-011f-4a11-ad28-1d6248eb22a9":{"type":"addtext","settings":{"titleship":"Do I have to pay taxes?","detailship":"<p>All international orders may be subjected to taxes, customs and duty fees as defined by the country of import. Any charges on a parcel are the recipient’s responsibility and must be paid by the parcel recipient. The additional taxes, customs, and duty fees are not included in your order and\/or shipping total. CERM is not responsible for fees associated with imports.<\/p>"}},"53407ae1-b6ac-4f4f-ab60-a0182ff69b50":{"type":"addfaq","settings":{"descript_tit":"1- WHERE IS MY ORDER?","adding_description":"<p>After your order has been processed and shipped out of our facility, you will receive an email with the tracking number. You can also access the tracking number by logging into your account on our website.<br\/>As we use a door to door service, you should be able to track on the status of your order at anytime using the tracking link.<\/p>"}},"2149079d-6cf7-4b1e-871f-63d7ad64cfc2":{"type":"addfaq","settings":{"descript_tit":"2- WHAT IF MY ORDER IS STUCK AT CUSTOMS?","adding_description":"<p>If your order appears to be stuck at customs, please contact the local office of your shipping provider, which will be either Fedex or DHL. Most of the time, this is due to a pending import tax payment, or if your shipping information is incorrect.<br\/><br\/>Due to privacy issues, we are unable to contact your local shipping provider or the customs. The receiver of the package is required to contact them personally. Fedex and DHL have local hotlines in most countries.<\/p>"}},"d34022c7-e1a7-4142-87db-81167ebaabda":{"type":"addfaq","settings":{"descript_tit":"3- MY ORDER IS MISSING AN ITEM. WHAT SHOULD I DO?","adding_description":"<p>If there are discrepancies with your order, either send us an email immediately at cs@myinvity.com or contact us via live chat with your order number and issue. <\/p>"}},"dd2982cb-04d4-44fb-a19d-cb33140d158a":{"type":"addfaq","settings":{"descript_tit":"4- HOW DO I MAKE A RETURN OR EXCHANGE?","adding_description":"<p>If you are unhappy with your purchase or if you need to return it due to a discrepancy, reach out to us at cs@myinvity.com with your order number.<br\/><\/p>"}},"28f7e560-606d-4de5-be01-e713c10aca51":{"type":"addfaq","settings":{"descript_tit":"5- WHAT IS YOUR RETURN POLICY","adding_description":"<p>If you wish to make a return, please send us an email to cs@myinvity.com within 30 days of your purchase. However, we cannot accept products that have been heavily used, emptied, nearly emptied or tampered with for refunds or exchanges. We will provide a return authorization and mailing details upon confirming eligibility. Any refunds will be processed upon receipt of the returned item(s) and made via your original form of payment. Only items purchased on www.myinvity.com may be accepted for return or exchange. You are responsible for paying your own shipping costs when returning the item. <br\/><br\/>Only full priced, regular items may be refunded. We do not issue refunds on sale items or items purchased with a discount code. We are not responsible for personal damages to an item. If the item has been dropped, stolen, spilled, misused, etc., we cannot refund or accept a return. If a package is marked as delivered, but it is stolen or you are unable to locate it, we are unable to refund the order amount. Shipping charges are non-refundable and are not refunded in the event of the return of a product.<\/p>"}}},"block_order":["9a246145-b89e-4565-a5ab-0363183d7a24","99ebf639-ea46-44d8-ac0c-d26c27018c8e","9b807ac0-424c-417c-a51c-45581a864563","bed89c2a-011f-4a11-ad28-1d6248eb22a9","53407ae1-b6ac-4f4f-ab60-a0182ff69b50","2149079d-6cf7-4b1e-871f-63d7ad64cfc2","d34022c7-e1a7-4142-87db-81167ebaabda","dd2982cb-04d4-44fb-a19d-cb33140d158a","28f7e560-606d-4de5-be01-e713c10aca51"],"settings":{"titleship":"Shipping Policy"}}},"order":["main","1655366933f2220f1e","1657945564ae574c14"]}